;系统运行参数配置，请勿随意修改，以免造成系统运行异常

;最近用户信息
[UserInfo]
;用户名
UserName=

;系统配置
[SYSTEM]
;是否自动进入联网检测，默认：0，0-否，1-是
AutoEnterNetWorkDetection=0
;自动进入联网检测时间，默认：5，单位：秒，最低1秒，最高59秒
AutoEnterNetWorkDetectionTime=5
;工位位置，F：前，M：中，R：后
WPLocation=R
;是否扫描上线，默认：0，0-否，1-是
IsScanOnLine=0
;是否向工位状态软件发送信息
IsSendToPSS=0
;工位状态软件IP地址
PSSIP=127.0.0.1
;工位状态软件端口地址(本机会使用[PSSPort+1]端口)
PSSPort=10022

;排放检测参数
[EmissionParams]
;排放检测子项目,第4位:DIS(双怠速),第5位:FSUNHT(不透光自由加速),第6位:FSUYD(滤纸式自由加速)
EmissionSubItem=000111000
;尾气检验员（若为空时，用引车员代替）
EmissionDetector=
;遥控信号源，1-车速台，2-测功机,3-参数仪
RemoteControlSource=1

;DIS检测参数
[DISParams]
;转速测量方式，1-从仪器，2-从转速计
RevMeasureMode=1
;油温测量方式，1-从仪器
OilTempMeasureMode=1
;插管时间，单位：秒
InsertTubeTime=10
;是否一定进行怠速检测，0-否，1-是
MustISDetection=0
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;是否遥控或按钮才开始检测，0-否，1-是
RemoteControlStartDetection=1
;最大重检次数
MaxReDetectionTimes=0
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=1

;FAOPA检测参数
[FAOPAParams]
;插探头时间，单位：秒
InsertTubeTime=10
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;是否遥控或按钮才开始检测，0-否，1-是
RemoteControlStartDetection=1
;最大重检次数
MaxReDetectionTimes=0
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=1

;FASMO检测参数
[FASMOParams]
;插管时间，单位：秒
InsertTubeTime=10
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;是否遥控或按钮才开始检测，0-否，1-是
RemoteControlStartDetection=1
;最大重检次数
MaxReDetectionTimes=0
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=1

;环境参数
[EP]
;环境温度，单位：℃
ET=25.0
;大气压力，单位：kPa
AP=101.0
;相对湿度，单位：％
RH=80.0

;车速表检测参数
[SpeedometerParams]
;使用设备，0：车速台(默认)，1：测功机
SpeedTesterType=0
;车辆到位时间，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0
;表盘显示实时值，0-测量值，1-实时值
MeterDisplayRTData=0

;人工检测参数
[ManualParams]
;人工检测子项目,第1位:外观,第2位:动态,第3位:底盘
ManualSubItem=111
;条形码扫描仪扫描间隔，单位：毫秒
ScanInterval=500
;小车检测最短时间，单位：秒
LVMinDetectionTime=0
;大车检测最短时间，单位：秒
HVMinDetectionTime=0
;缩短检测时间打折，单位（%）
CutDetectionTimePercent=100
;外观检测员，Appearance Detector
AD2001=外检员1
AD2002=外检员2
AD2003=外检员3
AD2004=外检员4
AD2005=外检员5
;动态检测员，Dynamic Detector
DD2011=动检员1
DD2012=动检员2
DD2013=动检员3
DD2014=动检员4
DD2015=动检员5
;底盘检测员，Chassis Detector
CD2021=底检员1
CD2022=底检员2
CD2023=底检员3
CD2024=底检员4
CD2025=底检员5
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;综检是否显示流程，0-否，1-是
IsShowMFDStep=1
;人工检测策略，1：单独检测(默认)，2：在前照灯检测过程中检测
DetectStrategy=1
;最大重检次数
MaxReDetectionTimes=0
;一般显示时间，单位：秒
GeneralDisplayTime=1

;前照灯检测参数
[HeadlightParams]
;检测模式，0：单灯(默认)，1：双灯同检
DetectMode=0
;车辆到位时间，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测数据，0-否，1-是
IsShowMeasureData=1
;是否等待灯光仪复位完成才完成或结束检测，0-否，1-是
IsWaitHeadlightResetEnd=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;是否自动重检，0-否，1-是
IsAutoReDetect=1
;是否遥控或按钮才开始检测，0-否，1-是
RemoteControlStartDetection=0
;最大重检次数
MaxReDetectionTimes=0
;是否需要判定垂直偏移，0-否，1-是
IsNeedJudVO=1
;是否调整模式,0-否；1-是
IsAdjustLightMode=0
;是否在检测中检声级，0-否，1-是
HLDetIsDetSL=0

;侧滑检测参数
[SideSlipParams]
;检测策略, 0:单独检测(默认)， 1：外廓侧滑同时检测
DetectStrategy=0
;检测最长时间，单位：秒
MaxDetectionTime=5
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测数据，0-否，1-是
IsShowMeasureData=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0

;轮重检测参数
[AxleLoadParams]
;轮重检测策略，1：动态检测(默认)，2：静态检测
DetectStrategy=1
;检测最长时间，单位：秒
MaxDetectionTime=600
;车辆到位秒数，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测数据，0-否，1-是
IsShowMeasureData=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;轮重基准，0-无，L-左，R-右
WheelLoadReference=0
;最大重检次数
MaxReDetectionTimes=0
;是否检测前调零，0-否，1-是
IsZeroBeforeDet=0

;制动检测参数
[BrakeParams]
;制动台类型，0：滚筒式(默认)，1：平板式
BrakeTesterType=0
;制动台检测策略,1：顺序检测(默认)，2：轮重制动交替检测
DetectStrategy=1
;平板检测策略，0：整车式（默认），1：分轴式
PlatformStrategy=0
;牵引车免检策略,1：扫描全部免检轴(默认)，2：只需扫描一轴即可
TractorExemptionStrategy=1
;车辆到位时间，单位：秒
VehicleInPlaceTime=3
;阻滞力检测最长时间，单位：秒
MaxDetectionTime=5
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0
;数据无效时是否重检，0-否，1-是（默认）
IsInvalidDataReDet=1
;重检时是否检轴重
IsReDetectDetectAxleLoad=0
;是否检测前调零，0-否，1-是
IsZeroBeforeDet=1
;短驻车检测流程，0-否，1-是
ShortPBDet=0

;功率检测参数
[PowerParams]
;是否检测车速表，0：否（默认），1：是
IsDetectSpeedometer=0
;稳定速度允许踩尽油门的时间
SpeedStableTime=3
;功率检测阶段车速稳定时间[s]
PowerDetectionStableTime=5
;功率检测阶段采样时间[s]
PowerDetectionSamplingTime=3
;车辆到位时间，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0
;遥控信号源，1-测功机，2-车速台，3-参数仪，4-为避免遥控异常，车速大于30.0km/h稳定3s也可以结束
RemoteControlSource=1
;功率扫描阶段加载时间间隔,单位:毫秒,ms，只可以是500,1000,1500,2000
LoadTimeInterval=500
力矩间隔[N]，限制在50~500之间
IntervalOfTorque=500
;速度稳定范围，范围：1～15。
SteadySpeeSpen=5
;是否先使用一级判定流程检测，0-否，1-是
DetLv1First=0

;喇叭声级检测参数
[SoundLevelParams]
;车辆到位时间，单位：秒
VehicleInPlaceTime=3
;检测时间，单位：秒
DetectionTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0

;绝缘检测参数
[InsulationParams]
;绝缘电阻检测电压，单位：V
IRDetectionVoltage=36
;电阻下限，单位：MΩ
ResistanceLowerLimit=2.0
;交流耐压检测电压，单位：V
ACWDetectionVoltage=36
;电流上限，单位：mA
CurrentUpperLimit=2.0
;缓升时间，单位：秒
RampTime=10
;保持时间，单位：秒
DwellTime=60
;延迟时间，单位：秒
DelayTime=60
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示测量数据，0-否，1-是
IsShowMeasureData=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0

;悬架检测参数
[SuspensionParams]
;车辆到位秒数，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测数据，0-否，1-是
IsShowMeasureData=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0
;是否使用轮重仪数据，0-否，1-是
IsUseAxleLoadScaleData=0
;是否检测前调零，0-否，1-是
IsZeroBeforeDet=0
;是否更新实时曲线数据，0-否，1-是
IsUpdRTCurData=0

[SteeringAngleParams]
;车辆到位秒数，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;检测最长时间，单位：秒
MaxDetectionTime=60
;是否显示检测数据，0-否，1-是
IsShowMeasureData=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;定位最长时间，单位：秒
LocateMaxTime=30

;轮偏检测参数
[WheelOffsetParams]
;检测时间，单位：秒
DetectionTime=3
;车辆到位时间，单位：秒
VehicleInPlaceTime=3
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=30
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测数据，0-否，1-是
IsShowMeasureData=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;最大重检次数
MaxReDetectionTimes=0

;整备质量检测参数
[UMParams]
;挂车检测时，是否先上牵引车 1:是，0:否(只对线外有用)
TractorFist=0
;整备检测策略，1：单独检测(默认)，2：在平板制动检测过程中检测，3：和车速一起检
DetectStrategy=1
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=1
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;是否检测前调零，0-否，1-是
IsZeroBeforeDet=0
;最大重检次数
MaxReDetectionTimes=0

; 遥控器参数
[RemoteControllerParams]
;使用的功能键在灯屏上的提示文字;
UsePress1DisPlay=A
UsePress2DisPlay=B
UsePress3DisPlay=C
UsePress4DisPlay=D

;使用的功能键代码值
;YCF102-4-12(4字母按键遥控）：  代码值：A-0001、B-0010、C-0100、D-1000
;YCF8504A-4-12(4数字按键遥控）：代码值：1-0010、2-0001、3-0100、4-1000
;YCF512(12数字按键遥控）：       代码值：1-1000、2-0001、3-1001、4-0100、5-1100、6-0101、7-1101、8-0010、9-1010、10-0011、11-1011、12-0110
UsePress1Code=0001
UsePress2Code=0010
UsePress3Code=0100
UsePress4Code=1000

;外廓尺寸检测参数
[DimensionParams]
;数据交互文件夹，请填写绝对路径，末尾不要加“\”
DEFolderPath=D:\Share
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;一般显示时间，单位：秒
GeneralDisplayTime=2
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;是否读取检测过程提示信息，0-否，1-是
IsReadDetInfo=0
;是否使用人工修正，0-否，1-是
IsUpdateData=0

;油耗检测参数
[FuelConParams]
;加载力矩间隔[N]，限制在50~500之间
IntervalOfTorque=200
;加载时间间隔,单位:毫秒,ms，只可以是500,1000,1500,2000
LoadTimeInt=300
;车辆到位时间[s]
VehicleInPlaceTime=3
;插入取样管准备时间[s]
InsTubeTime=5
;车辆通过或离开工位最长时间，单位：秒
VehicleMaxPassTime=3
;是否显示检测界面，0-否，1-是
IsShowDetectionDlg=1
;速度稳定范围，范围：0.5～5
SteadySpeeSpen=0.5
